In [33]:
#Importing pandas to create dataframes
import pandas as pd

#Creating the dataframe (table) for student names and their IDs
name_list = [['V001','Abe'],['V002','Abhay'],['V003','Acelin'],['V004','Adelphos']]
name_table = pd.DataFrame(name_list, columns=['StudentID', 'Name'])
name_table

  StudentID      Name
0      V001       Abe
1      V002     Abhay
2      V003    Acelin
3      V004  Adelphos

In [34]:
#Creating the dataframe (table) for student IDs and their total marks
mark_list = [['V001',95],['V002',80],['V003',74],['V004',81]]
mark_table = pd.DataFrame(mark_list, columns=['StudentID','Total_marks'])
mark_table

  StudentID  Total_marks
0      V001           95
1      V002           80
2      V003           74
3      V004           81

In [35]:
#a) Based on the following two tables, write a SQL query that returns the name and student ID of all students 
#that have a higher total marks score than the student that has StudentID of 'V002’

#SQL Code also submitted

threshold = mark_table.loc[mark_table['StudentID']=='V002']
threshold = threshold['Total_marks']

high_score = dict()

for i in range(len(mark_table['Total_marks'])):
    #print(mark_table['Total_marks'][i])
    if mark_table['Total_marks'][i] > int(threshold):
        high_score[mark_table['StudentID'][i]] = (name_table['Name'][i], mark_table['Total_marks'][i])
high_score

{'V001': ('Abe', 95), 'V004': ('Adelphos', 81)}

In [36]:
#b) Assume that the two tables are pandas data frame variables. 
#Based on those two data frames--utilizing pandas--write a python function that returns a new data frame version of
#name_table, where each name containing the letter “e” is uppercased, and lowercased otherwise (e.g. “Edward” → “EDWARD”, “Bob” → “bob”).

def letter_e(df):
    #loop over the names to see which names contain the letter 'e'
    for i in range(len(df['Name'])):
        if 'e' in df['Name'][i]:
            df['Name'][i] = df['Name'][i].upper()
        elif 'e' not in df['Name'][i]:
            df['Name'][i] = df['Name'][i].lower()
    
    #return the updated dataframe which contains upper case Names with letter 'e'
    return df

df = letter_e(name_table)
df #updated dataframe

  StudentID      Name
0      V001       ABE
1      V002     abhay
2      V003    ACELIN
3      V004  ADELPHOS

In [37]:
#c) Now write a function that takes in the output of 1) b) and mark_table 
#and returns a data frame that summarizes the average grade of uppercase names and lowercase names

def average(updated_df, mark_table):
    upper_case = [] #Create lists for calculating average
    lower_case = []
    
    #Loop over the names to find which names are upper cased and which ones are not
    for i in range(len(updated_df['Name'])):
        if updated_df['Name'][i].isupper():
            upper_case.append(mark_table['Total_marks'][i]) #Append to appropriate lists for the calculation of averages
        elif updated_df['Name'][i].islower():
            lower_case.append(mark_table['Total_marks'][i])
    print("Average of upper case names: ", (sum(upper_case)/len(upper_case))) #Print averages
    print("Average of lower case names: ", (sum(lower_case)/len(lower_case)))
            
#Call the function to check
average(df, mark_table)

Average of upper case names:  83.33333333333333
Average of lower case names:  80.0

# Question 2

In [38]:
# The data file did not load. The Github website did not show the dataset, instead showed a 404 Not found error.
# The basic stragtegies to analyze a dataset would be as follows:

#Loading the data set using pandas:
# data = pd.read_csv("white_house_2017_salaries.csv")

#We can test to see if the data has been loaded correctly:
# data.head()

# A descibe method could be used to see the statistics of the data:
# data.describe()

#Based on the information, we can visualize the data and as scatter plots, line plots or histograms and bar graphs
#import matplotlib.pyplot as plt
#plt.scatter(x,y)
#plt.bar(x,y)
#plt.hist(x,y)

#Incase there are data rows which have missing values, we can fill them with NaN values:
#data.fillna()

#If these data rows are not necessary:
#data.dropna()

#Based on the data and required output, more statistics and information can be extracted